frontend/controllers/PhotoController.php

    public function actionCreate()
    {
        $model = new Photo();

        if ($model->load(Yii::$app->request->post())) {
            $imageName=time();
           // var_dump($_FILES); exit;
            $model->imageFile = UploadedFile::getInstance($model, 'imageFile');
            if (!empty($model->imageFile)){
                $model->image = 'uploads/' . $imageName . '.' . $model->imageFile->extension;
                $model->save();
                $model->imageFile->saveAs('uploads/' . $imageName . '.' . $model->imageFile->extension);
            }
        }

        $project = ArrayHelper::map(Project::find()->all(), 'id', 'project_id');
---
SELECT EXISTS(SELECT * FROM `project` WHERE `project`.`id`='454')