common/models/query/PhotographerQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `photographer`