common/models/query/ProjectQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `project`