frontend/models/query/UserQuery.php

SELECT * FROM `user`
---
    public function all($db = null)
    {
        return parent::all($db);